# for i in range(2, 12, 3):
#     print(i, end=" ")
# # 2 5 8 11 потому что у нас от 2 до 12 с шагом 3, вывело 11 потому что мы не включаем 12 

# number = 1
# while number <= 5:
#     print(number, end=" ")   
#     number += 2
# # Будет выполняться по число не достигнет 5


# for number in range(1, 8):    
#     if number % 2 == 0:        
#         continue    
#     print(number, end=" ")
# # Нечетные числа будут выведены потому что у нас задано условие что каждое четное число мы пропускаем но континью дает циклу продолжительность

# for number in range(1, 8):
#     if number > 4:
#         break
#     print(number, end=" ")
# # Когда мы перебрали 4 элемента брейк говорит что бы на 4 мы остановили наш цикл 


# for number in range(1,6):
#     if number == 3: 
#         print(number)
#         break
# else:
#     print("Завершено")
#     print("Кінець програми")
# # Какие сообщения будут выведены? Выведится 3, так как цикл споймал условие что если 3, мы выводим 3 и останавливаем программу
# # Почему не выполнится else? Потому что заданно условие что если цикл дойдет до 3 мы останавливаем программу
# # Что нужно изменить, чтобы сообщение Завершенопоявилось? Нужно поставить значение больше чем задано в рендж if number == 7: так как у нас конечный индекс 6

# for item in []:
#     print("Тіло циклу")
# else:
#     print("Цикл завершено")
# # Так как цикл начинается, он хочет взять первый элемент, а никакого элемента в списке и нет, поэтому элс выполнится 


# for i in range(1, 4):
#     for j in range(1, 3):
#         print(i,j)
# # Каждый раз когда начинается И цикл, дж цикл начинается заново от 1 до 2, например у нас и столов, и за каждым столом по дж человека

for i in range(1, 6):
    if i == 2:
        continue
    if i == 5:
        break
    print(i, end=" ")
else:
    print("Готово")
# Определите результат и объясните, почему continueне не завершает весь цикл, а break завершает.

#Потому что заданно условие что если 2, то мы его пропускаем и продолжаем цикл, но когда цикл сталкивается с условием что мы достигли 5, то в условии сказанно что мы заканчиваем цикл
